export default {
  projections: {
    ЗаписьГостяE: {
      кодЗаписи: {
        __caption__: 'Код записи'
      },
      гости: {
        __caption__: 'Гости',
        имя: {
          __caption__: 'Имя'
        },
        фамилия: {
          __caption__: 'Фамилия'
        },
        отчество: {
          __caption__: 'Отчество'
        }
      },
      сотрудник: {
        __caption__: 'Сотрудник',
        кодCотрудника: {
          __caption__: 'Код сотрудника'
        }
      },
      комментарий: {
        __caption__: 'Комментарий'
      }
    },
    ЗаписьГостяL: {
      кодЗаписи: {
        __caption__: 'Код записи'
      },
      гости: {
        __caption__: 'Имя',
        имя: {
          __caption__: 'Имя'
        },
        фамилия: {
          __caption__: 'Фамилия'
        },
        отчество: {
          __caption__: 'Отчество'
        }
      },
      сотрудник: {
        __caption__: 'Код Сотрудника',
        кодCотрудника: {
          __caption__: 'Код Сотрудника'
        }
      },
      комментарий: {
        __caption__: 'Комментарий'
      }
    }
  },
  validations: {
    кодЗаписи: {
      __caption__: 'Код записи'
    },
    комментарий: {
      __caption__: 'Комментарий'
    },
    гости: {
      __caption__: 'Гости'
    },
    сотрудник: {
      __caption__: 'Сотрудник'
    }
  }
};
