export default {
  projections: {
    ДоступE: {
      кодДоступа: {
        __caption__: 'Код доступа'
      },
      доступ: {
        __caption__: 'Доступ'
      },
      комната: {
        __caption__: 'Комната',
        класс: {
          __caption__: 'Класс'
        },
        кодКомнаты: {
          __caption__: 'Код комнаты'
        },
        колвоМест: {
          __caption__: 'Колво мест'
        },
        стоимость: {
          __caption__: 'Стоимость'
        }
      },
      регистрЗаписи: {
        __caption__: 'Регистр записи',
        кодРегистра: {
          __caption__: 'Код регистра'
        },
        датаЗаселения: {
          __caption__: 'Дата заселения'
        },
        датаВыезда: {
          __caption__: 'Дата выезда'
        }
      }
    },
    ДоступL: {
      кодДоступа: {
        __caption__: 'Код доступа'
      },
      доступ: {
        __caption__: 'Доступ'
      },
      комната: {
        __caption__: 'Класс',
        класс: {
          __caption__: 'Класс'
        },
        кодКомнаты: {
          __caption__: 'Код комнаты'
        },
        колвоМест: {
          __caption__: 'колво мест'
        },
        стоимость: {
          __caption__: 'Стоимость'
        }
      }
    }
  },
  validations: {
    доступ: {
      __caption__: 'Доступ'
    },
    кодДоступа: {
      __caption__: 'Код доступа'
    },
    комната: {
      __caption__: 'Комната'
    },
    регистрЗаписи: {
      __caption__: 'Регистр записи'
    }
  }
};
